Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: For example, in a fixed-width integer type with a bitWidth value of 8, the number 31 has five bits equal to 1.
ja: 例えば、８のbitWidth値を持つ固定長整数型において、数31は1に等しいビットを５つ持ちます。

source: For example, in an integer type with a bitWidth value of 8, the number 31 has three leading zeros.
ja: 例えば、８のbitWidth値を持つ整数型において、数31は３つの先頭のゼロを持ちます。

source: For example, keeping an actor alive must also keep the actor’s associated executor alive; if they are different objects, the executor must be referenced strongly by the actor.
ja: 例えば、あるアクターを生かし続けることはまた、そのアクターのもつ関連エグゼキュータも生かし続ける必要があります； それらが異なるオブジェクトであるならば、エグゼキュータはアクターによって強く参照されなければなりません。

source: For example, like every Unicode scalar, the musical fermata symbol (“𝄐”) can be represented in UTF-32 as a single code unit.
ja: 例えば、すべてのユニコードスカラーのように、音楽のフェルマータ符号（“𝄐”）はUTF-32において単一のコード単位として表されることができます。

source: For example, strings of up to 15 UTF-8 code units in length may be represented in a small-string representation, and thus will be spilled into temporary stack space which is invalid after withUTF8 finishes execution.
ja: 例えば、長さで15 UTF-8コード単位までの文字列は、ある小さな文字列表現で表されるかもしれません、そしてそれゆえ一時スタック空間へとこぼされるでしょう、それはwithUTF8が遂行を終了する後に無効にされます。

source: For example, suppose you have an array holding the number of absences from each class during a session.
ja: 例えば、あなたがある学期（２学期制）の各クラスの欠席者数が入った配列を持つと考えてください。

source: For example, the flag string declared above comprises a single character, but is composed of eight code units when encoded as UTF-8.
ja: 例えば、上で宣言されるflag文字列はある単一の文字で構成されます、しかしUTF-8としてエンコードされる時は８つのコード単位から構成されます。

source: For example, the print(address:as:) function in the following code sample takes an UnsafeMutableRawPointer instance as its first parameter:
ja: 例えば、print(address:as:)関数は以下のコード例において、UnsafeMutableRawPointerインスタンスをそれの最初のパラメータとして取ります。

source: For example, the print(address:as:) function in the following code sample takes an UnsafeRawPointer instance as its first parameter:
ja: 例えば、print(address:as:)関数は以下のコード例において、UnsafeRawPointerインスタンスをそれの最初のパラメータとして取ります。

source: For example, the printInt(atAddress:) function in the following code sample expects an UnsafeMutablePointer<Int> instance as its first parameter:
ja: 例えば、printInt(atAddress:)関数は以下のコード例において、UnsafeMutablePointer<Int>インスタンスをそれの最初のパラメータとして期待します。

source: For example, the printInt(atAddress:) function in the following code sample expects an UnsafePointer<Int> instance as its first parameter:
ja: 例えば、printInt(atAddress:)関数は以下のコード例において、UnsafePointer<Int>インスタンスをそれの最初のパラメータとして期待します。

source: For example, the name of U+FE18 is “PRESENTATION FORM FOR VERTICAL RIGHT WHITE LENTICULAR BRACKET” (note that “BRACKET” is misspelled).
ja: たとえば、U+FE18 のnameは “PRESENTATION FORM FOR VERTICAL RIGHT WHITE LENTICULAR BRAKCET” です（ “BRACKET” に綴り間違いがあるのに注意してください）。

source: For example, the German letter “ß” (U+00DF LATIN SMALL LETTER SHARP S) becomes “SS” (U+0053 LATIN CAPITAL LETTER S, U+0053 LATIN CAPITAL LETTER S) when converted to uppercase.
ja: 例えば、ドイツ語文字 “ß” (U+00DF LATIN SMALL LETTER SHARP S) は、アッパーケースに変換される場合は “SS” (U+0053 LATIN CAPITAL LETTER S, U+0053 LATIN CAPITAL LETTER S) になります。

source: For example, the Latin small capitals that are used by the International Phonetic Alphabet have a case, but do not change when they are mapped to any of the other cases.
ja: 例えば、国際音声記号に使われるラテンスモールキャピタルはあるケースを持ちます、しかしそれらが何らかの他のケースにマップされる時に変更を行いません。

source: For example, the character “İ” (U+0130 LATIN CAPITAL LETTER I WITH DOT ABOVE) becomes two scalars (U+0069 LATIN SMALL LETTER I, U+0307 COMBINING DOT ABOVE) when converted to lowercase.
ja: 例えば、文字 “İ” (U+0130 LATIN CAPITAL LETTER I WITH DOT ABOVE) は、ローワーケースに変換される場合は２つのスカラー (U+0069 LATIN SMALL LETTER I, U+0307 COMBINING DOT ABOVE) になります。

source: For example, the following code declares countLetterChanges(_:_:), a function that finds the number of changes required to change one word or phrase into another.
ja: 例えば、以下のコードはcountLetterChanges(_:_:)、ある単語または語句を別のものへ変更するのに必要とされる変更の数を見つける関数、を宣言します。

source: For example, the following code sample creates a Unicode.Scalar instance with a value of "7":
ja: 例えば、以下のコード見本はUnicode.Scalarインスタンスを"7"の値で作成します：

source: For example, the following code sample creates a Unicode.Scalar instance with a value of "밥", the Korean word for rice:
ja: 例えば、以下のコード見本はUnicode.Scalarインスタンスをコリアン単語での米、"밥"の値で作成します：

source: For example, the following code sample creates a Unicode.Scalar instance with a value of an emoji character:
ja: 例えば、以下のコード見本はUnicode.Scalarインスタンスをあるemoji文字の値で作成します：

source: For example, the following conversions result in nil:
ja: 例えば、次の変換はnilという結果になります：

source: For example, the ligature “ﬁ” (U+FB01 LATIN SMALL LIGATURE FI) becomes “Fi” (U+0046 LATIN CAPITAL LETTER F, U+0069 LATIN SMALL LETTER I) when converted to titlecase.
ja: 例えば、合字 “ﬁ” (U+FB01 LATIN SMALL LIGATURE FI) は、タイトルケースに変換される場合は “Fi” (U+0046 LATIN CAPITAL LETTER F, U+0069 LATIN SMALL LETTER I) になります。

source: For example, the musical fermata symbol (“𝄐”) is a single Unicode scalar value (\u{1D110}) but requires four code units for its UTF-8 representation.
ja: 例えば、音楽のフェルマータ符号（“𝄐”）は単一のユニコードスカラー値（\u{1D110}）ですが４つのコード単位をそれのUTF-8表現のために必要とします。

source: For example, the musical fermata symbol (“𝄐”) is a single Unicode scalar value (\u{1D110}) but requires two code units for its UTF-16 representation.
ja: 例えば、音楽のフェルマータ符号（“𝄐”）は単一のユニコードスカラー値（\u{1D110}）ですが２つのコード単位をそれのUTF-16表現のために必要とします。

source: For example, the number -8 has three trailing zeros.
ja: 例えば、数-8は後に続くゼロを３つ持ちます。

source: For example, the two method calls in this example are equivalent:
ja: 例えば、この例での２つのメソッド呼び出しは同等です：

source: For example, the various “family” emoji are encoded as sequences of man, woman, or child emoji that are interleaved with zero width joiners.
ja: 例えば、様々な「家族」絵文字は、一連の男の人、女の人、または子供の絵文字として符号化されます、それらはゼロ幅接合子で綴じられます。

source: For example, this code finds the first letter after the first space:
ja: 例えば、このコードは最初の空白の後で最初の文字を見つけます：

source: For example, this custom Point struct uses the default representation supplied by the standard library.
ja: 例えば、このあつらえのPoint structは、標準ライブラリによって提供される省略時の表現を使います。

source: For example, this hypothetical Date type stores its value as the number of days before or after January 1, 2000:
ja: 例えば、この仮説上のDate型は、それの値を2000年１月１日の前または後の日数として格納します：

source: For example, to get the reversed version of a string, reverse its characters and initialize a new String instance from the result.
ja: 例えば、ある文字列の逆版を得るには、それの文字を逆にして、新しいStringインスタンスをその結果から初期化してください。

source: For example, to replace a value stored in a raw pointer p, where U is the current type and T is the new type, use a typed pointer to access and deinitialize the current value before initializing the memory with a new value.
ja: 例えば、生のポインタpに格納される値を置き換えるには、そこでUは現在の型でTは新しい型です、型付ポインタを使ってアクセスして現在の値をデイニシャライズしてください、新しい値でメモリを初期化する前にです。

source: For example, to retrieve the first word of a longer string, you can search for a space and then create a substring from a prefix of the string up to that point:
ja: 例えば、ある長い文字列の最初の単語を取り出すには、あなたは空白を捜してから、その文字列の前の部分からその地点までの下位文字列を作成できます：

source: For example, to retrieve the first word of a longer string, you can search the string for a space and then create a new string from a prefix of the string up to that point.
ja: 例えば、ある長い文字列の最初の単語を取り出すには、あなたはその文字列を空白について調査して、それからその文字列の前の部分からその地点までの新しい文字列を作成できます。

source: For example, use this initializer to create a string with ten "0" characters in a row.
ja: 例えば、このイニシャライザを使うことで、10個の"0"文字を１行に持つ文字列を作成してください。

source: For example, using a PartialRangeFrom range expression with an array accesses the subrange from the start of the range expression until the end of the array.
ja: 例えば、PartialRangeFrom範囲式をある配列で使うことは、その下位範囲に範囲式の始まりから配列の終わりまでにアクセスします。

source: For example, when converting a 16-bit value to an 8-bit type, only the lower 8 bits of source are used.
ja: 例えば、16bit値を8bit型へ変換する場合、sourceの最も下位の8ビットが使われます。

source: For example, when the character é is represented in its decomposed form, the grapheme base is “e” (U+0065 LATIN SMALL LETTER E) and it is followed by a single grapheme extender, U+0301 COMBINING ACUTE ACCENT.
ja: 例えば、文字éがそれの分解形式で表現されるならば、書記素基底は “e” (U+0065 LATIN SMALL LETTER E) です、そしてそれは後に単一の書記素拡張、U+0301 COMBINING ACUTE ACCENTが続きます。

source: For example, when the transform receives 3 from the base sequence, it creates a new Counter that produces the values 1, 2, and 3.
ja: 例えば、変換が3を基底シーケンスから受け取る場合、それは新しいCounterを作成します、そしてそれが値1、2、そして3を生み出します。

source: For example, you can concatenate the elements of a Range<Int> instance and an integer array.
ja: 例えば、あなたはあるRange<Int>インスタンスとある整数配列とに属する要素を連結することができます。

source: For example, you can concatenate the elements of an integer array and a Range<Int> instance.
ja: 例えば、あなたはある整数配列とあるRange<Int>インスタンスとに属する要素を連結することができます。

source: For example, you can concatenate the elements of two integer arrays.
ja: 例えば、あなたは２つの整数配列に属する要素を連結することができます。

source: For example, you can iterate over a range of Int and use sequence and collection methods.
ja: 例えば、あなたはある範囲のIntのすべてに反復してシーケンスおよびコレクションのメソッドを使うことができます。

source: For example, you can replace an element of an array by using its subscript.
ja: 例えば、あなたは配列の中のある要素をそれの添え字を使うことによって置き換えることができます。

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled() method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled()メソッドをその範囲上で呼び出すことによって可能です：

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled(using:) method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled(using:)メソッドをその範囲上で呼び出すことによって可能です：

source: For example, you can test whether the first UInt8 value in a string’s UTF-8 encoding is equal to the first UInt32 value in its Unicode scalar view:
ja: 例えば、あなたはある文字列のUTF-8符号化の中の最初のUInt8値が、それのユニコードスカラー値での最初のUInt32と等しいかどうかを試験できます。

source: For example, you can test whether the first UInt8 value in a string’s UTF-8 encoding is not equal to the first UInt32 value in its Unicode scalar view:
ja: 例えば、あなたはある文字列のUTF-8符号化の中の最初のUInt8値が、それのユニコードスカラー値での最初のUInt32と等しくないかどうかを試験できます。

source: For example, you can use stride(from:to:by:) to iterate over an interval of floating-point values:
ja: 例えば、あなたはstride(from:to:by:)を使って浮動小数点値のある間隔のすべてにわたって反復できます。

source: For example, you can use the shuffle(using:) method to randomly reorder the elements of an array.
ja: 例えば、あなたはshuffle(using:)メソッドを使って、配列の要素を無作為に再配列することができます。

source: For example, you can use this initializer to create a string with ten "ab" strings in a row.
ja: 例えば、あなたはこのイニシャライザを使うことで、10個の"ab"文字列をひとつの行に持つ文字列を作成できます。

source: For example, you can use this method on a sequence of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値からなるシーケンス上で使うことで、それらの和または積を見つけます。

source: For example, you can use this method on an array of integers to filter adjacent equal entries or count frequencies.
ja: 例えば、あなたはこのメソッドを整数からなる配列で使うことで、隣接する同等の項目をフィルタしたり頻度を数えたりできます。

source: For example, you can use this method on an array of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値いくつかからなる配列で使うことで、それらの和または積を見つけます。

source: For example, you can use this method on an sequence of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値からなるシーケンス上で使うことで、それらの和または積を見つけます。

source: For example, you can use this method to call an API that expects a pointer to a different type that is layout compatible with your pointer’s Pointee.
ja: 例えば、あなたはこのメソッドを使うことで、異なる型へのポインタを期待するもので、あなたのポインタのもつPointeeと互換のレイアウトである、あるAPIを呼び出すことができます。

source: For example, “i” is soft dotted because the dot disappears when adding an accent mark, as in “í”.
ja: たとえば、 “i” は、ソフトドットを持ちます、なぜならそのドットはアクセント符号を、“í” でのように、加えられる時に見えなくなるからです。

source: For example:
ja: 例えば：

source: For formats which don’t support this feature, the default implementation encodes the given object unconditionally.
ja: この機能性をサポートしない形式に対して、省略時の実装は与えられたオブジェクトを無条件にエンコードします。

source: For information about key-path expressions, see Key-Path Expression in The Swift Programming Language (Swift 4.1).
ja: キーパス式についての情報として、キーパス式をSwiftプログラミング言語 (Swift 4.1)で見てください。

source: For integer types, any remainder of the division is discarded.
ja: 整数型に対して、除算の余りは何であれ破棄されます。

source: For more about arithmetic with overflow operators, see Overflow Operators in The Swift Programming Language.
ja: オーバーフロー演算子を使う算術についてさらには、オーバーフロー演算子をSwiftプログラミング言語で見てください。

source: For more detail, see the documentation for the APIs used by each platform.
ja: 詳細として、各プラットホームで使われるAPIの文書を見てください。

source: For more information about operation declarations, see Operator Declaration in The Swift Programming Language.
ja: 演算子宣言についての更なる情報として、演算子宣言をSwiftプログラミング言語で見てください。

source: For more information about the Unicode terms used in this discussion, see the Unicode.org glossary.
ja: この解説において使われるユニコード用語についてのさらなる情報は、Unicode.org用語集を見てください。

source: For more information about the iteration order and semantics, see TaskGroup.next().
ja: 反復順序と意味論についてのさらなる情報として、TaskGroup.next()を見てください。

source: For more information about the iteration order and semantics, see ThrowingTaskGroup.next()
ja: 反復順序と意味論についてのさらなる情報として、ThrowingTaskGroup.next()を見てください。

source: For more information on setting up watch faces, see Change the watch face on your Apple Watch.
ja: ウォッチフェイスを設定することに関するさらなる情報として、Change the watch face on your Apple Watchを見てください。

source: For more information on the original version, see Creating and Updating a Complication’s Timeline.
ja: オリジナルバージョンに関するさらなる情報として、Creating and Updating a Complication’s Timelineを見てください。

source: For more information, see the top-level StringInterpolationProtocol documentation.
ja: 更なる情報として、トップレベルのStringInterpolationProtocolを見てください。

source: For other collections the counters may be out of range or of the wrong type to use as an index.
ja: 他のコレクションに対してこれらのカウンタは、インデックスとして使うのには範囲外または間違った型になるでしょう。

source: For scalars that represent a number, numericType is the numeric type of the scalar.
ja: ある数を表すスカラーに対して、numericTypeはそのスカラーの数値型です。

source: For scalars that represent a numeric value, numericValue is the whole or fractional value.
ja: ある数に関する値を表すスカラーに対して、numericValueは全体のまたは断片的な値です。

source: For such scalars, this property is nil.
ja: そのようなスカラーに対して、このプロパティはnilです。

source: For two integers a and b, a is a multiple of b if there exists a third integer q such that a = q*b.
ja: ２つの整数aとbに対して、aはbの倍数です、もし第３の整数qが存在して、a = q*bであるようなところでは。

source: For two values x and y, and a distance n = x.distance(to: y), x.advanced(by: n) == y.
ja: ２つの値xとy、そして隔たりn = x.distance(to: y)に対して、x.advanced(by: n) == y。

source: For unsigned integer types, this value is (2 ** bitWidth) - 1, where ** is exponentiation.
ja: 符号なし整数型に対して、この値は(2 ** bitWidth) - 1です、そこで**は冪演算です。

source: For unsigned integer types, this value is always 0.
ja: 符号なし整数型に対して、この値は常に0です。

source: Fortify your code with runtime checks, and examine your values' runtime representation.
ja: あなたのコードを実行時チェックで強化し、そしてあなたの値の実行時表現を検査します。

source: Foundation
ja: ファウンデーション

source: Framework
ja: フレームワーク

source: From Protocol
ja: 由来プロトコル

source: Functions
ja: 関数

source: Functions that use a TextOutputStream target may call write(_:) multiple times per writing operation.
ja: TextOutputStreamターゲットを使う関数は、write(_:)を書き込み操作のたびに複数回呼び出すでしょう。

source: Fundamental data types such as Int, Double, and String
ja: 基本的なデータ型、例えばInt、Double、そしてStringなど

source: Generally there are extra constraints imposed on core operations in order to allow this.
ja: 一般的にこれを可能にするためにコア演算上で課せられる余分な制約があります。

source: Generally, native Swift types that do not contain strong or weak references or other forms of indirection are trivial, as are imported C structs and enumerations.
ja: 一般に、生粋のSwift型で強いまたは弱い参照または他形式の間接参照を含まないものは自明です、インポートされたCの構造体と列挙のように。

source: Generally, native Swift types that do not contain strong or weak references or other forms of indirection are trivial, as are imported C structs and enums.
ja: 一般に、生粋のSwift型で強いまたは弱い参照または他形式の間接参照を含まないものは自明です、インポートされたCのstructとenumのように。

source: Generating Random Binary Data
ja: 無作為なバイナリデータを生成する

source: Generic Instance Method
ja: 総称体インスタンスメソッド

source: Generic Type Alias
ja: 総称体型エイリアス

source: Gets the value currently bound to this task-local from the current task.
ja: 現在このタスクローカルへと現在のタスクからバインドされる値を取得します。

source: Gets the value of this unmanaged reference as a managed reference and consumes an unbalanced retain of it.
ja: この管理されない参照の値を管理された参照として取得します、そしてそれのある不均衡なリテイン（保持）を使い果たします。

source: Gets the value of this unmanaged reference as a managed reference without consuming an unbalanced retain of it.
ja: この管理されない参照の値を管理された参照として取得します、それのある不均衡なリテイン（保持）を使い果たすことなしにです。

source: Getting C Strings
ja: C文字列を扱う

source: Getting Characters and Bytes
ja: 文字とバイトを取得する

source: Getting Substrings
ja: 下位文字列を取得する

source: Getting an Offset Value
ja: オフセット値の取得

source: Getting an Unsafe Reference to the Current Task
ja: 現在のタスクへの非安全参照を取得する

source: Global Numeric Functions
ja: グローバルな数値関数

source: Global functions such as print(_:separator:terminator:) and abs(_:)
ja: グローバル関数、print(_:separator:terminator:)そしてabs(_:)など

source: Greater than
ja: より大きい

source: Greater than or equal
ja: より大きいか、等しい

source: Greek iota subscript only (U+0345 COMBINING GREEK YPOGEGRAMMENI).
ja: ギリシャ語下付き文字イオタのみ (U+0345 COMBINING GREEK YPOGEGRAMMENI)。

source: Half-open range
ja: 半開範囲

source: Handling Dynamically Typed Methods and Objects in Swift
ja: 動的に型付メソッドとオブジェクトをSwiftにおいて取り扱う

source: Handling String Interpolations
ja: 文字列補間を取り扱う

source: Hash values are not guaranteed to be equal across different executions of your program.
ja: ハッシュ値は、あなたのプログラムの異なる実行をまたいで等しいことを保証されません。

source: Hashes the elements of the vector using the given hasher.
ja: ベクターの要素をこの与えられたハーシャーを使ってハッシュ化します。

source: Hashes the essential components of this value by feeding them into the given hasher.
ja: この値の本質的な構成要素を、それらをその与えられたhasherへと与えることによって、ハッシュ化します。

source: Here, the assignment to destBytes creates a new, nonowning buffer pointer covering the first n bytes of the memory that someBytes references—nothing is copied:
ja: ここで、destBytesへの割り当ては、someBytesが参照するメモリの最初のnバイトを変換して、新しい、非所有のバッファポインタを作成します — コピーされるものは何もありません：

source: Here, we find the length of the first sentence and create an uppercase version.
ja: ここで、私たちは最初の文の長さを見つけます、そして大文字バージョンを作成します。

source: Here’s an example of checking whether each code unit in a string’s utf16 view is a lead surrogate.
ja: ここに、ある文字列のもつutf16ビューの中の各コード単位が先頭サロゲートを持つかどうか調べる例があります。

source: Here’s an example of checking whether each code unit in a string’s utf16 view is a trailing surrogate.
ja: ここに、ある文字列のもつutf16ビューの中の各コード単位が後続サロゲートを持つかどうか調べる例があります。

source: Here’s an example of creating an array initialized with five strings containing the letter Z.
ja: ここに、字Zを含んでいる５つの文字列で初期化される配列を作成する例があります。

source: Here’s an example of inserting a range of integers into an array of the same type:
ja: ここに整数の範囲を同じ型の配列へ挿入する例があります：

source: Here’s an example of sorting a list of students’ names.
ja: ここに、生徒名のリストをソートする例があります。

source: Here’s an example of transforming a string to all lowercase letters.
ja: ここに、ある文字列を小文字の文字に変換する例があります：

source: Here’s an example that finds a student name that begins with the letter “A”:
ja: ここに、文字「A」で始まる生徒名を見つける例があります：

source: Here’s an implementation of those steps:
ja: ここにこれらの手順の実装があります：

source: However if there are no potential awaiting calls to next this function will return false, indicating that the caller needs to decide how the behavior should be handled.
ja: しかしながら潜在的に待機しているnextへの呼び出しがないならばこの関数はfalseを返すでしょう、それは呼び出し側がどのように挙動が取り扱われるべきか決定する必要があることを指し示します。

source: However, count may be zero even for a non-nil start.
ja: しかしながら、countは非nilのstartに対してもゼロであるかもしれません。

source: However, a buffer can have a count of zero even with a non-nil base address.
ja: しかしながら、バッファはゼロのcountを非nilに基づくアドレスでも持つことができます。

source: However, during development, the ability to verify that the invariants are being upheld in testing is important.
ja: しかしながら、開発の間は、試験することで不変式それらが支持されていることを検証できることは重要です。

source: However, if you pass 19 as rhs, the method first bitmasks rhs to 3, and then uses that masked value as the number of bits to shift lhs.
ja: しかしながら、あなたが19をrhsとして渡すならば、このメソッドは最初にrhsを3にビットマスクして、それからそのマスクされた値をビット数として使うことでlhsをシフトします。

source: However, if you use 19 as rhs, the operation first bitmasks rhs to 3, and then uses that masked value as the number of bits to shift lhs.
ja: しかしながら、あなたが19をrhsとして使うならば、この演算は最初にrhsを3にビットマスクして、それからそのマスクされた値をビット数として使うことでlhsをシフトします。

source: However, if you use 8 as the shift amount, the method first masks the shift amount to zero, and then performs the shift, resulting in no change to the original value.
ja: しかしながら、あなたが8をシフト量として使うならば、メソッドは最初にそのシフト量をマスクしてゼロにして、それからシフトを実行して、元の値に対して変更しないという結果になります。

source: However, initializing another collection with an UnsafeMutableRawBufferPointer instance copies bytes out of the referenced memory and into the new collection.
ja: しかしながら、別のコレクションをUnsafeMutableRawBufferPointerインスタンスで初期化することは、バイトを参照されたメモリから外へそして新しいコレクションへとコピーします、

source: However, initializing another collection with an UnsafeBufferPointer instance copies the instances out of the referenced memory and into the new collection.
ja: しかしながら、別のコレクションをUnsafeBufferPointerインスタンスで初期化することは、インスタンスを参照されたメモリから外へそして新しいコレクションへとコピーします、

source: However, initializing another collection with an UnsafeMutableBufferPointer instance copies the instances out of the referenced memory and into the new collection.
ja: しかしながら、別のコレクションをUnsafeMutableBufferPointerインスタンスで初期化することは、インスタンスを参照されたメモリから外へそして新しいコレクションへとコピーします、

source: However, initializing another collection with an UnsafeRawBufferPointer instance copies bytes out of the referenced memory and into the new collection.
ja: しかしながら、別のコレクションをUnsafeRawBufferPointerインスタンスで初期化することは、バイトを参照されたメモリから外へそして新しいコレクションへとコピーします、

source: However, it’s valid to make a new iterator for the task group, which you can use to continue iterating over the group’s results.
ja: しかしながら、新しいイテレータをタスクグループに対して作ることは有効です、それはあなたがグループのもつ結果それらのすべてにわたって反復することを継続するために使用できます。

source: However, the type of a function, method, or closure always includes a return type, which is Void if otherwise unspecified.
ja: しかしながら、関数、メソッド、またはクロージャは、常に戻り型を含みます、それは指定されないならばVoidです。

source: However, when the closure receives 4, it throws an error, terminating the sequence.
ja: しかしながら、クロージャが4を受け取る場合、それはシーケンスを終端して、エラーをスローします。

source: However, you may already have an existing project built with concurrency that uses other frameworks and techniques.
ja: しかしながら、あなたは既に、他のフレームワークと技法を使う並行性でビルドされた既存のプロジェクトを持っているかもしれません。

source: Identical
ja: 同一である

source: Identical to self.
ja: selfと同一。

source: Ideographic description characters are technically printable characters, but advanced rendering engines may use them to approximate ideographs that are otherwise unrepresentable.
ja: 表意文字記述文字は技術的には印刷に適した文字です、しかし先進のレンダリングエンジンは、それを使うことでそうしなければ表現できない表意文字の近似を得るかもしれません。

source: If areEquivalent(a, b) and areEquivalent(b, c) are both true, then areEquivalent(a, c) is also true.
ja: areEquivalent(a, b)とareEquivalent(b, c)が両方ともtrueならば、そのときareEquivalent(a, c)もまたtrueである。

source: If areInIncreasingOrder(a, b) and areInIncreasingOrder(b, c) are both true, then areInIncreasingOrder(a, c) is also true.
ja: areInIncreasingOrder(a, b)とareInIncreasingOrder(b, c)が両方ともtrueならば、そのときareInIncreasingOrder(a, c)もまたtrueである。

source: If bitPattern is zero, the result is nil.
ja: bitPatternがゼロならば、結果はnilです。

source: If body has a return value, that value is also used as the return value for the withCString(_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithCString(_:)メソッドの戻り値としても使われます。

source: If body has a return value, that value is also used as the return value for the withCString(encodedAs:_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithCString(encodedAs:_:)メソッドの戻り値としても使われます。
